//
//  main.c
//  prog02
//
//  Created by k19061kk on 2020/01/30.
//  Copyright © 2020 AIT. All rights reserved.
//

/*-----------------------------------------+
 プログラミング及び演習II
 第15回 期末試験解答 問題2
 1回の思考を表す構造体struct trialを定義せよ.
 構造体の情報を表示するdispTrial関数を作成せよ.
 また、以下の文字列を読み込み、構造体の各メンバ変数
 に代入し、dispTrial関数によって表示せよ.
    ・char line[] = "10,18\n";
 +-----------------------------------------*/

//定義======================================================================================
//インクルード------------------------------------------------------------
#include <stdio.h>

//構造体-----------------------------------------------------------------
typedef struct trial {
    int speed;      // 速度
    int distance;   // 制動距離
} Trial;

//関数プロトタイプ宣言=========================================================================
//基本操作関数-------------------------------------------------------------
int getSpeed(Trial trial);               // trialから速度の情報を取得する
void setSpeed(Trial *trial, int speed);  // trialに速度の情報を設定する
int getDist(Trial trial);                // trialから制動距離の情報を取得する
void setDist(Trial *trial, int dist);    // trialに制動距離の情報を設定する

//操作関数----------------------------------------------------------------
void dispTrial(Trial trial);             // trialの内容を表示する

//関数群====================================================================================
int main(int argc, const char * argv[]) {
    Trial trial;                  // 1回の試行の情報を格納する構造体
    char line[] = "10,18\n";      // 問題で指定された入力文字列
    int input_speed, input_dist;  // 入力用変数
    
    /*---lineから入力---*/
    sscanf(line, "%d,%d", &input_speed, &input_dist);
    
    /*---入力した値を構造体に格納---*/
    setSpeed(&trial, input_speed);
    setDist(&trial, input_dist);
    
    /*---dispTrialで表示---*/
    dispTrial(trial);
    
    return 0;
}

//基本操作関数-------------------------------------------------------------
//------------------------------------------------------------
//機能:trialから速度の情報を取得する
//引数 Trial trial:1回の試行を表す構造体
//返り値:trialに格納されている速度の情報
//------------------------------------------------------------
int getSpeed(Trial trial) {
    return(trial.speed);
}

//------------------------------------------------------------
//機能:trialに速度の情報を設定する
//引数 Trial *trial:速度の情報を格納する対象の構造体へのポインタ
//    int speed   :格納する速度情報
//返り値:なし
//------------------------------------------------------------
void setSpeed(Trial *trial, int speed) {
    trial -> speed = speed;
    return;
}

//------------------------------------------------------------
//機能:trialから制動距離の情報を取得する
//引数 Trial trial:1回の試行を表す構造体
//返り値:trialに格納されている制動距離の情報
//------------------------------------------------------------
int getDist(Trial trial) {
    return(trial.distance);
}

//------------------------------------------------------------
//機能:trialに制動距離の情報を設定する
//引数 Trial *trial:制動距離の情報を格納する対象の構造体へのポインタ
//    int dist    :格納する制動距離の情報
//返り値:なし
//------------------------------------------------------------
void setDist(Trial *trial, int dist) {
    trial -> distance = dist;
    return;
}

//操作関数----------------------------------------------------------------
//------------------------------------------------------------
//機能:trialの内容を表示する
//引数 Trial trial:内容を表示する構造体
//返り値:なし
//------------------------------------------------------------
void dispTrial(Trial trial) {
    printf("speed:%d, distance:%d\n", getSpeed(trial), getDist(trial));
    return;
}
